{
    "name": "Graph theory",
    "terms": [
        {
            "termDef": "Автоморфизм - изоморфизм графа с самим собой"
        },
        {
            "termDef": "Ациклический граф - {граф} без {циклов}"
        },
        {
            "termDef": "Бесконечный граф - граф, имеющий бесконечно много вершин и/или рёбер"
        },
        {
            "termDef": "Биграф - см. двудольный граф"
        },
        {
            "termDef": "Блок - {граф} без {шарниров}"
        },
        {
            "termDef": "Блок-дизайн с параметрами (v, k, λ) - покрытие с кратностью λ полного графа на v вершинах полными графами на k вершинах"
        },
        {
            "termDef": "Валентность вершины - {степень} вершины"
        },
        {
            "termDef": "Вершина - точка, где могут сходиться/выходить рёбра и/или дуги"
        },
        {
            "termDef": "Вес ребра - числовое значение, поставленное в соответствие данному {ребру} взвешенного графа. Обычно вес — вещественное число, в таком случае его можно интерпретировать как «длину» ребра"
        },
        {
            "termDef": "Взвешенный граф - {граф}, в котором каждому {ребру} поставлено в соответствие некое числовое значение ({вес ребра})"
        },
        {
            "termDef": "Висячая вершина - {вершина}, {степень} которой равна 1"
        },
        {
            "termDef": "Вполне несвязный граф (пустой граф, нуль-граф) - регулярный граф степени 0, то есть граф без рёбер"
        },
        {
            "termDef": "Высота дерева - наибольшая длина {пути} от {корня} к {листу}"
        },
        {
            "termDef": "Гамильтонов граф - граф, в {котором} есть {гамильтонов цикл}"
        },
        {
            "termDef": "Гамильтонов путь - {простой путь} в {графе}, содержащий все {вершины} {графа} ровно по одному разу"
        },
        {
            "termDef": "Гамильтонов цикл - простой цикл в графе, содержащий все вершины графа ровно по одному разу"
        },
        {
            "termDef": "Геометрическая реализация - фигура, вершинам которой соответствуют вершины графа, рёбрам — рёбра графа и рёбра в фигуре соединяют вершины, соответствующие вершинам в графе"
        },
        {
            "termDef": "Геометрический граф - плоская фигура из {вершин} — {точек} на плоскости и {рёбер} — {линий}, соединяющих некоторые пары вершин. Может представлять многими способами всякий {граф}"
        },
        {
            "termDef": "Гиперграф - й евклидовой степени множества вершин, то есть гиперрёбра соединяют произвольное количество вершин)"
        },
        {
            "termDef": "Гомеоморфные графы - графы, получаемые из одного графа с помощью последовательности подразбиений рёбер"
        },
        {
            "termDef": "Грань - область, ограниченная {ребрами} в {плоском графе} и не содержащая внутри себя {вершин} и {ребер} графа. Внешняя часть плоскости тоже образует грань"
        },
        {
            "termDef": "Граф - базовое понятие. Включает множество {вершин} и множество {ребер}, являющееся подмножеством декартова квадрата множества вершин (то есть каждое ребро соединяет ровно две вершины)"
        },
        {
            "termDef": "Граф рода g - граф, который можно изобразить без пересечений на поверхности рода g и нельзя изобразить без пересечений ни на одной поверхности рода g-1"
        },
        {
            "termDef": "Двойственный граф. Граф А называется двойственным к планарному графу В, если вершины графа А соответствуют граням графа В, и две вершины графа A соединены ребром тогда и только тогда, когда соответствующие грани графа B имеют хотя бы одно общее ребро. - "
        },
        {
            "termDef": "Двудольный граф (или биграф, или чётный граф) - это граф G ( V , E ) {\\displaystyle G(V,E)} G(V,E), такой, что множество вершин V разбито на два непересекающихся подмножества V 1 {\\displaystyle V_{1}} V_{1} и V 2 {\\displaystyle V_{2}} V_{2}, причём всякое ребро E инцидентно вершине из V 1 {\\displaystyle V_{1}} V_{1} и вершине из V 2 {\\displaystyle V_{2}} V_{2} (то есть соединяет вершину из V 1 {\\displaystyle V_{1}} V_{1} с вершиной из V 2 {\\displaystyle V_{2}} V_{2}). То есть правильная раскраска графа двумя цветами. Множества V 1 {\\displaystyle V_{1}} V_{1} и V 2 {\\displaystyle V_{2}} V_{2} называются «долями» двудольного графа. Двудольный граф называется «полным», если любые две вершины из V 1 {\\displaystyle V_{1}} V_{1} и V 2 {\\displaystyle V_{2}} V_{2} являются смежными. Если | V 1 | = a {\\displaystyle \\left|V_{1}\\right|=a} \\left|V_{1}\\right|=a, | V 2 | = b {\\displaystyle \\left|V_{2}\\right|=b} \\left|V_{2}\\right|=b, то полный двудольный граф обозначается K a , b {\\displaystyle K_{a,b}} K_{{a,b}}"
        },
        {
            "termDef": "Двусвязный граф - {связный граф}, в котором нет {шарниров}"
        },
        {
            "termDef": "Дерево - {связный граф}, не содержащий {циклов}"
        },
        {
            "termDef": "Диаметр графа - максимально возможное {расстояние между вершинами} для этого {графа}"
        },
        {
            "termDef": "Длина маршрута - количество рёбер в маршруте (с повторениями). Если маршрут M = v 0 , e 1 , v 1 , e 2 , v 2 , . . . , e k , v k {\\displaystyle M=v_{0},e_{1},v_{1},e_{2},v_{2},...,e_{k},v_{k}} M=v_{0},e_{1},v_{1},e_{2},v_{2},...,e_{k},v_{k}, то длина M равна k (обозначается | M | = k {\\displaystyle \\left|M\\right|=k} \\left|M\\right|=k)"
        },
        {
            "termDef": "Длина пути - число {дуг} {пути} (или сумма длин его дуг, если последние заданы)"
        },
        {
            "termDef": "Дуга - это ориентированное (имеющее направление) {ребро}"
        },
        {
            "termDef": "Дополнение графа - граф над тем же множеством вершин, что и исходный, но вершины соединены ребром тогда и только тогда, когда в исходном графе ребра нет"
        },
        {
            "termDef": "Ежевика неориентированного графа G - это семейство связных подграфов графа G, касающихся друг друга"
        },
        {
            "termDef": "Граф звезда - {полный} {двудольный граф}"
        },
        {
            "termDef": "Изолированная вершина - {вершина}, {степень} которой равна 0 (то есть нет {рёбер}, {инцидентных} ей)"
        },
        {
            "termDef": "Изоморфизм - два графа называются изоморфными, если существует перестановка вершин, при которой они совпадают. Иначе говоря, два графа называются изоморфными, если существует взаимно однозначное соответствие между их {вершинами} и {рёбрами}, которое сохраняет {смежность} и {инцидентность} (графы отличаются только названиями своих вершин)"
        },
        {
            "termDef": "Инвариант графа - числовая характеристика графа или их упорядоченный вектор, характеризующая структуру графа инвариантно относительно перенумерации вершин"
        },
        {
            "termDef": "Интервальный граф - граф, вершины которого могут быть взаимно однозначно поставлены в соответствие отрезкам на действительной оси таким образом, что две вершины инцидентны одному ребру тогда и только тогда, когда отрезки, соответствующие этим вершинам, пересекаются"
        },
        {
            "termDef": "Инцидентность - понятие, используемое только в отношении {ребра} или {дуги} и {вершины}.\nЕсли v1 , v2 — вершины, а e = (v1 , v2) — соединяющее их ребро, тогда вершина v1 и ребро e инцидентны, вершина v2 и ребро e тоже инцидентны. Две вершины (или два ребра) инцидентными быть не могут"
        },
        {
            "termDef": "Клетка - {регулярный граф} наименьшего {обхвата} для заданной {степени} {вершин}"
        },
        {
            "termDef": "Клика - подмножество {вершин} {графа}, полностью соединённых друг с другом, то есть {подграф}, являющийся {полным графом}"
        },
        {
            "termDef": "Кликовое число (англ. clique number) - число (G) вершин в наибольшей клике. Другие названия — густота, плотность"
        },
        {
            "termDef": "Максимальная клика - {клика} с максимально возможным числом {вершин} среди клик {графа}"
        },
        {
            "termDef": "Колесо - это {граф} с n вершинами (n ≥ 4), образованный соединением единственной {вершины} со всеми {вершинами} (n-1)-{цикла}"
        },
        {
            "termDef": "Конечный граф - граф, содержащий конечное число вершин и рёбер"
        },
        {
            "termDef": "Конструктивное перечисление графов - получение полного списка графов в заданном классе"
        },
        {
            "termDef": "Компонента связности графа - некоторое подмножество вершин графа, такое, что для любых двух вершин из этого множества существует путь из одной в другую, и не существует пути из вершины этого множества в вершину не из этого множества"
        },
        {
            "termDef": "Компонента сильной связности графа, слой - максимальное множество вершин ориентированного графа, такое, что для любых двух вершин из этого множества существует путь как из первой во вторую, так и из второй в первую"
        },
        {
            "termDef": "Контур - {Цикл} в {орграфе}"
        },
        {
            "termDef": "Корень дерева - выбранная {вершина} {дерева}; в {орграфе} — вершина с нулевой {степенью} захода"
        },
        {
            "termDef": "Коцикл - минимальный разрез, минимальное множество рёбер, удаление которого делает граф несвязным"
        },
        {
            "termDef": "Кратные рёбра - несколько {ребер} в {мультиграфе}, {инцидентных} одной и той же паре {вершин}"
        },
        {
            "termDef": "Кубический граф - регулярный граф степени 3, то есть граф, в котором каждой вершине инцидентно ровно три ребра"
        },
        {
            "termDef": "k - дольный граф — граф G, у которого хроматическое число c(G)=k"
        },
        {
            "termDef": "k-связный граф - связный граф, в котором не существует набора V ′ {\\displaystyle V'} V' из k − 1 {\\displaystyle k-1} k-1 или менее вершин, такого, что удаление всех вершин V ′ {\\displaystyle V'} V' и инцидентных им рёбер нарушает связность графа. В частности, связный граф является 1-связным, а двусвязный — 2-связным"
        },
        {
            "termDef": "Лама́нов граф с n вершинами - первых, для каждого k любой подграф графа G, содержащий k вершин, имеет не более, чем 2k −3 ребра и, во-вторых, граф G имеет ровно 2n −3 ребра"
        },
        {
            "termDef": "Лес - {неориентированный граф} без {циклов}. {Компонентами связности} леса являются {деревья}"
        },
        {
            "termDef": "Лист - {вершина} {дерева} с единственным {ребром} или входящей {дугой}"
        },
        {
            "termDef": "Макси-код - трудновычислимый полный инвариант графа, получаемый путём выписывания двоичных значений матрицы смежности в строчку с последующим переводом полученного двоичного числа в десятичную форму. Макси-коду соответствует такой порядок следования строк и столбцов, при котором полученное значение является максимально возможным"
        },
        {
            "termDef": "Максимальное паросочетание в графе - паросочетание называется максимальным, если любое другое паросочетание содержит меньшее число рёбер"
        },
        {
            "termDef": "Маршрут - это чередующаяся последовательность {вершин} и {рёбер} v0, e1, v1, e2, v2, ..., ek, vk, в которой любые два соседних элемента {инцидентны}. Если v0 = vk, то маршрут замкнут, иначе открыт"
        },
        {
            "termDef": "Матрица достижимости орграфа - это матрица, содержащая информацию о существовании путей между вершинами в орграфе"
        },
        {
            "termDef": "Матрица инцидентности графа - матрица, значения элементов которой характеризуется инцидентностью соответствующих вершин графа (по вертикали) и его рёбер (по горизонтали). Для неориентированного графа элемент принимает значение 1, если соответствующие ему вершина и ребро инцидентны. Для ориентированного графа элемент принимает значение 1, если инцидентная вершина является началом ребра, значение -1, если инцидентная вершина является концом ребра; в остальных случаях (в том числе и для петель) значению элемента присваивается 0"
        },
        {
            "termDef": "Матрица смежности графа - это матрица, значения элементов которой характеризуются смежностью вершин графа. При этом значению элемента матрицы присваивается количество рёбер, которые соединяют соответствующие вершины (то есть которые инцидентны обоим вершинам). Петля считается сразу двумя соединениями для вершины, то есть к значению элемента матрицы в таком случае следует прибавлять 2"
        },
        {
            "termDef": "Мини-код - трудновычислимый полный инвариант графа, получаемый путём выписывания двоичных значений матрицы смежности в строчку с последующим переводом полученного двоичного числа в десятичную форму. Мини-коду соответствует такой порядок следования строк и столбцов, при котором полученное значение является минимально возможным"
        },
        {
            "termDef": "Минимальный каркас (или каркас минимального веса, минимальное остовное дерево) графа - ациклическое (не имеющее циклов) множество рёбер в связном, взвешенном и неориентированном графе, соединяющих между собой все вершины данного графа, при этом сумма весов всех рёбер в нём минимальна"
        },
        {
            "termDef": "Множество смежности вершины v - множество вершин, смежных с вершиной v. Обозначается Γ + ( v ) {\\displaystyle \\Gamma ^{+}(v)} \\Gamma ^{+}(v)"
        },
        {
            "termDef": "Минором графа - называется граф, который можно получить из исходного путём удаления и стягивания дуг"
        },
        {
            "termDef": "Мост - {ребро}, удаление которого увеличивает количество {компонент связности} в {графе}"
        },
        {
            "termDef": "Мультиграф - {граф}, в котором может быть пара {вершин}, которая соединена более чем одним {ребром} (ненаправленным), либо более чем двумя {дугами} противоположных направлений"
        },
        {
            "termDef": "Направленный граф - ориентированный граф, в котором две вершины соединяются не более чем одной дугой"
        },
        {
            "termDef": "Направленный ациклический граф - {орграф} без {контуров}"
        },
        {
            "termDef": "Независимое множество вершин (известное также как внутренне устойчивое множество) - есть множество вершин графа G, такое, что любые две вершины в нём несмежны (никакая пара вершин не соединена ребром)"
        },
        {
            "termDef": "Независимые вершины - попарно не {смежные} {вершины} {графа}"
        },
        {
            "termDef": "Неразделимый граф - {связный}, непустой, не имеющий {точек сочленения} {граф}"
        },
        {
            "termDef": "Нормированный граф - ориентированный граф без циклов"
        },
        {
            "termDef": "Нуль-граф - регулярный граф степени 0, то есть граф, не содержащий рёбер"
        },
        {
            "termDef": "Обхват - {длина} наименьшего {цикла} в {графе}"
        },
        {
            "termDef": "Объединение графов - граф G 1 ∪ G 2 {\\displaystyle G_{1}\\cup G_{2}} G_{1}\\cup G_{2}, множеством вершин которого является X 1 ∪ X 2 {\\displaystyle X_{1}\\cup X_{2}} X_{1}\\cup X_{2}, а множеством рёбер — U = U 1 ∪ U 2 {\\displaystyle U=U_{1}\\cup U_{2}} U=U_{1}\\cup U_{2}"
        },
        {
            "termDef": "Окрестность порядка k - множество {вершин} с {расстоянием между вершинами} равным k к выбранной вершине. Иногда толкуется расширительно как множество вершин, отстоящих от v на расстоянии не больше k"
        },
        {
            "termDef": "Окружение - множество {вершин}, {смежных} с заданной"
        },
        {
            "termDef": "Орграф, ориентированный граф G = (V,E) есть пара множеств, где V - множество вершин (узлов), E — множество дуг (ориентированных рёбер). Дуга — это упорядоченная пара вершин (v, w), где вершину v называют началом, а w — концом дуги. Можно сказать, что дуга v → w ведёт от вершины v к вершине w, при этом вершина w смежная с вершиной v"
        },
        {
            "termDef": "Остовное дерево (остов) (неориентированного) связного графа G = ( V , E ) {\\displaystyle G=(V,E)} G=(V,E) - всякий частичный граф S = ( V , T ) {\\displaystyle S=(V,T)} S=(V,T), являющийся деревом"
        },
        {
            "termDef": "Остовный подграф - {подграф}, содержащий все {вершины}"
        },
        {
            "termDef": "Паросочетание - это набор попарно не {смежных} {ребер}"
        },
        {
            "termDef": "Петля - {ребро}, начало и конец которого находятся в одной и той же {вершине}"
        },
        {
            "termDef": "Пересечение графов (помеченных графов G 1 = ( X 1 , U 1 ) {\\displaystyle G_{1}=(X_{1},U_{1})} G_{1}=(X_{1},U_{1}) и G 2 = ( X 2 , U 2 ) {\\displaystyle G_{2}=(X_{2},U_{2})} G_{2}=(X_{2},U_{2})) - граф G 1 ∩ G 2 {\\displaystyle G_{1}\\cap G_{2}} G_{1}\\cap G_{2}, множеством вершин которого является X 1 ∩ X 2 {\\displaystyle X_{1}\\cap X_{2}} X_{1}\\cap X_{2}, а множеством рёбер — U = U 1 ∩ U 2 {\\displaystyle U=U_{1}\\cap U_{2}} U=U_{1}\\cap U_{2}"
        },
        {
            "termDef": "Перечисление графов - подсчет числа неизоморфных графов в заданном классе (с заданными характеристиками)"
        },
        {
            "termDef": "Периферийная вершина - вершина, эксцентриситет которой равен диаметру графа"
        },
        {
            "termDef": "Планарный граф - граф, который может быть изображён (уложен) на плоскости без пересечения рёбер. Изоморфен плоскому графу, то есть является графом с пересечениями, но допускающий его плоскую укладку, поэтому может отличаться от плоского графа изображением на плоскости. Таким образом, может быть разница между плоским графом и планарным графом при изображении на плоскости"
        },
        {
            "termDef": "Плоский граф - {геометрический граф}, в котором никакие два {ребра} не имеют общих вершин, кроме инцидентной им обоим вершины (не пересекаются). Является {уложенным графом} на плоскости"
        },
        {
            "termDef": "Подграф исходного графа - граф, содержащий некое подмножество вершин данного графа и некое подмножество инцидентных им рёбер. (ср. Суграф.) По отношению к подграфу исходный граф называется суперграфом"
        },
        {
            "termDef": "Полный граф - граф, в котором для каждой пары {вершин} v1, v2, существует {ребро}, {инцидентное} v1 и {инцидентное} v2 (каждая вершина соединена ребром с любой другой вершиной)"
        },
        {
            "termDef": "Полный инвариант графа - числовая характеристика графа или их упорядоченный вектор, значения которой необходимо и достаточно для установления изоморфизма графов"
        },
        {
            "termDef": "Полным двудольным называется двудольный граф, в котором каждая вершина одного подмножества соединена ребром с каждой вершиной другого подмножества - "
        },
        {
            "termDef": "Полустепень захода в орграфе для вершины v {\\displaystyle v} v - число дуг, входящих в вершину. Обозначается d + ( v ) {\\displaystyle d^{+}(v)} d^{+}(v), d e g + ( v ) {\\displaystyle \\mathrm {deg} ^{+}(v)} \\mathrm {deg} ^{+}(v), i n d e g ( v ) {\\displaystyle \\mathrm {indeg} (v)} \\mathrm {indeg} (v) или d t ( v ) {\\displaystyle d_{t}(v)} d_{t}(v)"
        },
        {
            "termDef": "Полустепень исхода в орграфе для вершины v {\\displaystyle v} v - }(v)} d^{-}(v), d e g − ( v ) {\\displaystyle \\mathrm {deg} ^{-}(v)} \\mathrm {deg} ^{-}(v), o u t d e g ( v ) {\\displaystyle \\mathrm {outdeg} (v)} \\mathrm {outdeg} (v) или d o ( v ) {\\displaystyle d_{o}(v)} d_{o}(v)"
        },
        {
            "termDef": "Помеченный граф - либо метки, например, натуральные числа или символы какого-нибудь алфавита"
        },
        {
            "termDef": "Порождённый подграф - подграф, порождённый множеством рёбер исходного графа. Содержит не обязательно все вершины графа, но эти вершины соединены такими же рёбрами, как в графе"
        },
        {
            "termDef": "Порядок графа - количество {вершин} {графа}"
        },
        {
            "termDef": "Правильная раскраска графа - раскраска, при которой каждый цветной класс является независимым множеством. Иначе говоря, в правильной раскраске любые две смежные вершины должны иметь разные цвета"
        },
        {
            "termDef": "Произведение графов - для данных графов G 1 = ( V 1 , E 1 ) {\\displaystyle G_{1}=(V_{1},E_{1})} G_{1}=(V_{1},E_{1}) и G 2 = ( V 2 , E 2 ) {\\displaystyle G_{2}=(V_{2},E_{2})} G_{2}=(V_{2},E_{2}) произведением называется граф G = ( V , E ) {\\displaystyle G=(V,E)} G=(V,E), вершины которого V ( G ) = V 1 × V 2 {\\displaystyle V(G)=V_{1}\\times V_{2}} V(G)=V_{1}\\times V_{2} — декартово произведение множеств вершин исходных графов"
        },
        {
            "termDef": "Простая цепь - {Цепь} в которой все вершины различны"
        },
        {
            "termDef": "Простой граф - {граф}, в котором нет {кратных} {ребер} и {петель}"
        },
        {
            "termDef": "Простой путь - {путь}, все вершины которого попарно различны[4]. Другими словами, простой путь не проходит дважды через одну вершину"
        },
        {
            "termDef": "Простой цикл - {цикл}, не проходящий дважды через одну {вершину}"
        },
        {
            "termDef": "Псевдограф - {граф}, который может содержать {петли} и/или {кратные рёбра}"
        },
        {
            "termDef": "Пустой граф (вполне несвязный граф, нуль - граф) — регулярный граф степени 0, то есть граф, не содержащий рёбер"
        },
        {
            "termDef": "Путь - последовательность {ребер} (в {неориентированном графе}) и/или {дуг} (в {ориентированном графе}), такая, что конец одной дуги (ребра) является началом другой дуги (ребра). Или последовательность вершин и дуг (рёбер), в которой каждый элемент {инцидентен} предыдущему и последующему. Может рассматриваться как частный случай {маршрута}"
        },
        {
            "termDef": "Радиус графа - минимальный из эксцентриситетов вершин связного графа; вершина, на которой достигается этот минимум, называется центральной вершиной"
        },
        {
            "termDef": "Разбиение графа - представление исходного графа в виде множества подмножеств вершин по определенным правилам"
        },
        {
            "termDef": "Разделяющая вершина - то же, что и {шарнир} и точка сочленения"
        },
        {
            "termDef": "Развёртка графа - функция, заданная на вершинах ориентированного графа"
        },
        {
            "termDef": "Размеченный граф - граф, для которого задано множество меток S, функция разметки вершин f : A → S и функция разметки дуг g : R → S. Графически эти функции представляются надписыванием меток на вершинах и дугах. Множество меток может разделяться на два непересекающихся подмножества меток вершин и меток дуг"
        },
        {
            "termDef": "Разрез - множество {ребер}, удаление которого делает {граф} {несвязным графом}"
        },
        {
            "termDef": "Рамочный граф - граф, который можно нарисовать на плоскости таким способом, что любая ограниченная грань является четырёхугольником и любая вершина с тремя и менее соседями инцидентна неограниченной грани.[5]"
        },
        {
            "termDef": "Раскраска графа - разбиение вершин на множества (называемые цветами). Если при этом нет двух смежных вершин, принадлежащих одному и тому же множеству (то есть две смежные вершины всегда разного цвета), то такая раскраска называется правильной"
        },
        {
            "termDef": "Расстояние между вершинами - длина кратчайшей {цепи} (в {орграфе} {пути}), соединяющей заданные {вершины}. Если такой цепи (пути) не существует, расстояние полагается равным бесконечности"
        },
        {
            "termDef": "Ребро - условная линия, соединяющая две {вершины} графа"
        },
        {
            "termDef": "Регулярный граф - {граф}, {степени} всех {вершин} которого равны. Степень регулярности является инвариантом графа и обозначается r (G). Для нерегулярных графов r (G) не определено"
        },
        {
            "termDef": "Регулярный граф степени 0 (вполне несвязный граф, пустой граф, нуль - граф) — граф без рёбер"
        },
        {
            "termDef": "Самодвойственный граф - граф, изоморфный своему двойственному графу"
        },
        {
            "termDef": "Сверхстройное (зведообразное) дерево - дерево, в котором имеется единственная вершина степени больше 2"
        },
        {
            "termDef": "Связность. Две вершины в графе связаны, если существует соединяющая их (простая) цепь. - "
        },
        {
            "termDef": "Связный граф - {граф}, в котором все {вершины} {связаны}"
        },
        {
            "termDef": "Сечение графа - множество {рёбер}, удаление которых делит {граф} на два изолированных {подграфа}, один из которых, в частности, может быть {тривиальным графом}"
        },
        {
            "termDef": "Сеть - в принципе, то же, что и {граф}, хотя сетями обычно называют графы, вершины которых определённым образом помечены"
        },
        {
            "termDef": "Ориентированная сеть - ориентированный граф, не содержащий контуров"
        },
        {
            "termDef": "Сильная связность - две вершины в ориентированном графе сильно связаны, если существует путь из первой во вторую и из второй в первую."
        },
        {
            "termDef": "Сильно связный орграф - орграф, в котором все вершины сильно связаны"
        },
        {
            "termDef": "Смежность - понятие, используемое в отношении только двух рёбер либо только двух вершин: Два {ребра}, {инцидентные} одной {вершине}, называются смежными; две {вершины}, {инцидентные} одному {ребру}, также называются {смежными}. (ср. Инцидентность.)"
        },
        {
            "termDef": "Смешанный граф - {граф}, содержащий как {ребра}, так и {дуги}"
        },
        {
            "termDef": "Совершенное паросочетание - паросочетание, содержащее все вершины графа"
        },
        {
            "termDef": "Соединением двух графов G 1 = ( V 1 , E 1 ) {\\displaystyle G_{1}=(V_{1},E_{1})} G_{1}=(V_{1},E_{1}) и G 2 = ( V 2 , E 2 ) {\\displaystyle G_{2}=(V_{2},E_{2})} G_{2}=(V_{2},E_{2}), не имеющих общих вершин, называется граф G 1 + G 2 = ( V 1 ∪ V 2 , E 1 ∪ E 2 ∪ V 1 × V 2 ∪ V 2 × V 1 ) {\\displaystyle G_{1}+G_{2}=(V_{1}\\cup V_{2},E_{1}\\cup E_{2}\\cup V_{1}\\times V_{2}\\cup V_{2}\\times V_{1})} G_{1}+G_{2}=(V_{1}\\cup V_{2},E_{1}\\cup E_{2}\\cup V_{1}\\times V_{2}\\cup V_{2}\\times V_{1}) - "
        },
        {
            "termDef": "Спектр графа - множество всех собственных значений матрицы смежности с учётом кратных рёбер"
        },
        {
            "termDef": "Степень - количество {ребер} графа G, {инцидентных} {вершине} x. Обозначается d (x). Минимальная степень вершины графа G обозначается δ (G). а максимальная — Δ (G)"
        },
        {
            "termDef": "Стягивание ребра графа - замена концов ребра одной вершиной, соседями новой вершины становятся соседи этих концов. Граф G 1 {\\displaystyle G_{1}} G_{1} стягиваем к G 2 {\\displaystyle G_{2}} G_{2}, если второй можно получить из первого последовательностью стягиваний рёбер"
        },
        {
            "termDef": "Суграф (частичный граф) исходного графа - граф, содержащий все вершины исходного графа и подмножество его рёбер. (ср. Подграф.)"
        },
        {
            "termDef": "Суперграф - это любой граф, содержащий исходный граф (то есть для которого исходный граф является подграфом)"
        },
        {
            "termDef": "Тета граф - граф, состоящий из объединения трёх путей, не имеющих внутри общих вершин, у которых конечные вершины одни и те же[7]"
        },
        {
            "termDef": "Тетаграф - граф множества точек евклидовой плоскости строится как система конусов, окружающих каждую вершину с добавлением ребра для каждого конуса к точке множества, проекция которой на центральную ось конуса минимальна"
        },
        {
            "termDef": "Тождественный граф - единственный автоморфизм — тождественный. Образно говоря, тождественный граф — это «абсолютно несимметричный» граф"
        },
        {
            "termDef": "Точка сочленения - то же, что и {шарнир} и разделяющая вершина"
        },
        {
            "termDef": "Триангуляция поверхности - укладка графа на поверхность, разбивающая её на треугольные области; частный случай топологической триангуляции"
        },
        {
            "termDef": "Тривиальный граф - {граф}, состоящий из одной {вершины}"
        },
        {
            "termDef": "Турнир - ориентированный граф, в котором каждая пара вершин соединена одним ребром"
        },
        {
            "termDef": "Узел - {вершина}"
        },
        {
            "termDef": "Укладка - процесс построения {плоского графа}"
        },
        {
            "termDef": "Укрытие - уклонения на графе путём использования этой функции на каждом шаге игры для определения безопасных множеств вершин, куда можно перейти"
        },
        {
            "termDef": "Упорядоченный граф - граф, в котором рёбра, выходящие из каждой вершины, однозначно пронумерованы, начиная с 1. Рёбра считаются упорядоченными в порядке возрастания номеров. При графическом представлении часто рёбра считаются упорядоченными в порядке некоторого стандартного обхода (например, против часовой стрелки)"
        },
        {
            "termDef": "n-фактор графа - регулярный остовный подграф степени n {\\displaystyle n} n"
        },
        {
            "termDef": "n-факторизация графа - разбиение графа на независимые n-факторы"
        },
        {
            "termDef": "Хроматическое число графа - минимальное количество цветов, требуемое для раскраски вершин графа, при которой любые вершины, соединенные ребром, раскрашены в разные цвета"
        },
        {
            "termDef": "Характеристический многочлен графа - это характеристический многочлен его матрицы смежности"
        },
        {
            "termDef": "Центр графа - множество вершин W = {u1, u2, ..., un}, для которых справедливо равенство: ∀ i = 1, ..., n : ε (ui) = r(G), где ε — это {эксцентриситет вершины}, а r — {радиус графа}"
        },
        {
            "termDef": "Цепь - {маршрут}, все {рёбра} которого различны"
        },
        {
            "termDef": "Цикл - замкнутая {цепь}"
        },
        {
            "termDef": "Цикл Гамильтона - то же, что и {Гамильтонов цикл}"
        },
        {
            "termDef": "Цикломатическое число графа - |V(G)|,} p_{1}(G)=p_{0}(G)+|E(G)|-|V(G)|, где p 1 ( G ) {\\displaystyle p_{1}(G)} p_{1}(G) — цикломатическое число, p 0 {\\displaystyle p_{0}} p_{0} — число {компонент связности} графа, | E ( G ) | {\\displaystyle |E(G)|} |E(G)| — число рёбер, а | V ( G ) | {\\displaystyle |V(G)|} |V(G)| — число вершин"
        },
        {
            "termDef": "Частичный граф - то же, что и {суграф}"
        },
        {
            "termDef": "Чётный граф - то же, что и двудольный граф"
        },
        {
            "termDef": "Шарнир - {вершина} {графа}, в результате удаления которой вместе со всеми {инцидентными} ей {ребрами} количество {компонент связности} в {графе} возрастает"
        },
        {
            "termDef": "Шестерёнка (обозначается G n {\\displaystyle G_{n}} G_{n}) - граф, получаемый из колеса путём размещения дополнительных вершин между каждой парой смежных вершин периметра. Шестерёнки принадлежат семейству рамочных графов и играют важную роль при описании запрещённых подграфов рамочных графов[8]"
        },
        {
            "termDef": "Эйлеров граф - это граф, в котором существует цикл, содержащий все рёбра графа по одному разу (вершины могут повторяться)"
        },
        {
            "termDef": "Эйлерова цепь (или эйлеров цикл) - это цепь (цикл), которая содержит все рёбра графа (вершины могут повторяться)"
        },
        {
            "termDef": "Эксцентриситет вершины - максимальное расстояние из всех {расстояний между вершинами} от других вершин до данной вершины"
        },
        {
            "termDef": "Элементарный путь - путь, вершины которого, за исключением, быть может, первой и последней, различны. Другими словами, простой путь не проходит дважды через одну вершину, но может начаться и закончиться в одной и той же вершине, в таком случае он называется циклом (элементарным циклом)"
        },
        {
            "termDef": "Элементарным стягиванием называется такая процедура: берем ребро (вместе с инцидентными ему вершинами, например, u и v) и «стягиваем» его, то есть удаляем ребро и отождествляем вершины u и v. Полученная при этом вершина инцидентна тем рёбрам (отличным от), которым первоначально были инцидентны u или v. - "
        },
        {
            "termDef": "Орцепь - {Цепь} в {орграфе}"
        },
        {
            "termDef": "Ориентированный граф - {Граф}, содержащий {дуги}"
        },
        {
            "termDef": "Орграф - {Ориентированный граф}"
        }
    ]
}
