{
    "name": "Rationality",
    "terms": [
        {
            "termDef": "Гильотина Юма - {бритва}, утверждающая невозможность перехода от {описательных суждений} к {предписательным суждениям}"
        },
        {
            "termDef": "Бритва Хенлона - {бритва}, утверждающая что не следует приписывать злому умыслу то, что можно объяснить глупостью"
        },
        {
            "termDef": "Приостановка неверия - "
        },
        {
            "termDef": "Ключевые вопросы - "
        },
        {
            "termDef": "Почему ты веришь в то, во что ты веришь? - {Ключевой вопрос}"
        },
        {
            "termDef": "Упражнение - "
        },
        {
            "termDef": "Представлять все 4 варианта исходов - {Упражнение}"
        },
        {
            "termDef": "2. Осознанный выбор методов решения - "
        },
        {
            "termDef": "Построение онтологии: - Какие варианты выбора есть, и как ваше удовольствие от них зависит"
        },
        {
            "termDef": "Внутренний симулятор - Попытка с закрытыми глазами представить результат.\nОценить качественный эмоциональный выхлоп. \nОценить количественный эмоциональный выхлоп.\nА теперь количественный выхлоп через месяц после.\nДальше нужно оценить количество ресурсов на каждый из вариантов"
        },
        {
            "termDef": "Когнитивные искажения мешают выигрыванию - "
        },
        {
            "termDef": "Важнейшие принципы мышления - "
        },
        {
            "termDef": "Нулевая гипотеза - принимаемая по-умолчанию {гипотеза} о том, что не существует связи между двумя наблюдаемыми событиями. Считается верной, пока нельзя {доказано} обратное"
        },
        {
            "termDef": "Нулевая гипотеза существования/несуществования - {нулевая гипотеза}"
        },
        {
            "termDef": "Нулевая гипотеза корелляции - {нулевая гипотеза}"
        },
        {
            "termDef": "Нулевая гипотеза максимальной статистической вероятности/частного случая - {нулевая гипотеза}"
        },
        {
            "termDef": "Карта - 12"
        },
        {
            "termDef": "Территория - "
        },
        {
            "termDef": "Суждение - {мысль} или фраза, утверждающая какое-либо {отношение}"
        },
        {
            "termDef": "Описательное суждение - {суждение} со словами \"есть\", \"является\""
        },
        {
            "termDef": "Предписательное суждение - {суждение} со словом {должен}"
        },
        {
            "termDef": "Индивидуальное понятие - {понятие}, которое относятся к единичным, уникальным, {сущностям} ({объем понятия} 1)"
        },
        {
            "termDef": "Понятие - отображенное в {мышлении} единство существенных {свойств} и {отношений} некоторой {сущности} или {операции}"
        },
        {
            "termDef": "Единичное понятие - {индивидуальное понятие}"
        },
        {
            "termDef": "Общие понятия - {понятия}, которые формируют группу или класс предметов или явлений, имеющих известное сходство между собой"
        },
        {
            "termDef": "Классовое понятие - {общие понятия}"
        },
        {
            "termDef": "Собирательное понятие - {понятие} обозначающее группу, состоящую из одинаковых единиц"
        },
        {
            "termDef": "Коллективное понятие - {собирательное понятие}"
        },
        {
            "termDef": "Употребление понятия в разделительном смысле - случай употребления при котором утверждение справедливо относительно каждого элемента {понятия}"
        },
        {
            "termDef": "Употребление понятия в собирательном смысле - случай употребления при котором {понятие} справедливо для группы в целом, но не обязательно для каждого ее элемента"
        },
        {
            "termDef": "Термин - слово или словосочетание, являющееся названием некоторого {понятия}"
        },
        {
            "termDef": "Абстрактный термин - {термин}, который служит для обозначения {свойств}, состояний, действия вещей"
        },
        {
            "termDef": "Конкретный термин - {термины} вещей, предметов, лиц, фактов, событий, состояний, сознания, если мы рассматриваем их имеющими определённое существование, например «квадрат», «пламя», «дом», «сражение», «страх»  и т.п"
        },
        {
            "termDef": "Парность терминов в языке - в языке иногда {абстрактные термины}  {конкретные термины} употребляются попарно. Например, {конкретному термину} «белый» соответствует абстрактное понятие «белизна», конкретному термину «строгий» соответствует абстрактное понятие «строгость», термину «квадрат» — «квадратность», «человек» — «человечность»"
        },
        {
            "termDef": "Положительный термин - {термин}, указывающий на наличие определенного {свойства}"
        },
        {
            "termDef": "Отрицательный термин - {термин}, указывающий на отсутствие определенного качества"
        },
        {
            "termDef": "Абсолютный термин - такой {термин}, который в своём значении не содержит никакого отношения к чему либо другому, он не принуждает нас мыслить \nо каких-либо других вещах, кроме тех, которые он обозначает"
        },
        {
            "termDef": "Относительный термин - {термин}, который кроме того предмета, который он означает, предполагает существование также и другого предмета"
        },
        {
            "termDef": "Основное свойство - одно или несколько {свойств}, без которых мы не можем мыслить о {термине} и которые излагают природу предмета, описываемого {термином}"
        },
        {
            "termDef": "Дополнительное свойство - {свойство}, без которого {термин} описывающий {сущность} в состоянии обойтись"
        },
        {
            "termDef": "Родовое свойство - {свойство} описывающее принадлежность {термина} к определенному надклассу {терминов}"
        },
        {
            "termDef": "Признак видового различия - {свойство}, служащее для выделения {термина} из ряда ему подобных {терминов}"
        },
        {
            "termDef": "Вид - признак, сочетающий в себе одновременно {родовой признак} и {признак видового различия}"
        },
        {
            "termDef": "Собственное свойство - {свойство}, которое выводится из {основных свойств}"
        },
        {
            "termDef": "Несобственное свойство - {свойство}, которое не может быть выведено из {основного свойства}, хотя и может быть присуще всем вещам данного класса"
        },
        {
            "termDef": "Неотделимый несобственный признак - {несобственное свойство}, присущий всем вещам данного класса"
        },
        {
            "termDef": "Отделимый несобственный признак - {несобственное свойство}, который присущ только некоторым вещам того или иного класса"
        },
        {
            "termDef": "Содержание понятия - сумма {свойств}, имеющихся в {термине}"
        },
        {
            "termDef": "Объем понятия - полный набор тех {сущностей}, к которым данное {понятие} применимо"
        },
        {
            "termDef": "Обобщение понятия - образование более общего {понятия} из менее общего путем отбрасывания некоторого количества {видовых признаков}"
        },
        {
            "termDef": "Ограничение понятия - образование из {общего понятия} {видового понятия} путем добавления видовых {свойств}"
        },
        {
            "termDef": "Категории - "
        },
        {
            "termDef": "Субстанция - {Категория}"
        },
        {
            "termDef": "Количество - {Категория}"
        },
        {
            "termDef": "Качество2 - {Категория}"
        },
        {
            "termDef": "Отношение3 - {Категория}"
        },
        {
            "termDef": "Место - {Категория}"
        },
        {
            "termDef": "Время - {Категория}"
        },
        {
            "termDef": "Положение - {Категория}"
        },
        {
            "termDef": "Действие - {Категория}"
        },
        {
            "termDef": "Страдание - {Категория}"
        },
        {
            "termDef": "Равнозначащие понятия - {отношение} одного {понятия} к другому, при котором они имеют одинаковый {объем понятия} и разное {содержание понятия}"
        },
        {
            "termDef": "Противоречащие понятия - отношение между {понятиями}, при котором для {понятия} А существует другое {понятие} B, относительно которого известно только то, что оно не есть A."
        },
        {
            "termDef": "Противоположное понятие - отношение между {понятиями} при котором понятия входят в один {объем понятий}, но по значению какого-либо из свойств максимально удалены друг от друга"
        },
        {
            "termDef": "Скрещивающиеся понятия - {отношение} между {понятиями}, при котором {содержание понятия} различно, но {объем понятий} частично совпадает"
        },
        {
            "termDef": "Несравнимые понятия - {отношение} между {понятиями} при котором для двух понятий нет такого {родового понятия}, общего для них обоих, в рамках которого их можно было бы сравнить"
        },
        {
            "termDef": "Простое понятие - {понятие}, {содержание понятия} которого невозможно раскрыть, поскольку оно доступны только для непосредственного восприятия/ощущения"
        },
        {
            "termDef": "Всякие штуки - Другие в этой формуле прибавляют к genus термин proximum: «definitro fit per \ngenus proximum et differentiam specificam» («определение совершается при помо-\nщи ближайшего рода и видового различия»), желая этим указать на то, что следует \nпользоваться ближайшим родовым понятием.\n1.\tОпределение должно быть соразмерным, т.е. таким, в котором объёмы опреде-\nляемого и определяющего тождественны, т.е. одинаково велики. Если правило \nэто нарушено, то определение неадекватно, или несоразмерно. В таком случае \nопределение делается или слишком широким или слишком узким, именно, если \nобъём определяющего становится слишком широким или слишком узким в \nсравнении с объёмом определяемого. Возьмём в пример определение лошади. \nЕсли сказать, что «лошадь есть домашнее животное», то это определение бу-\nдет слишком широким; в нём объём определяющего будет более широким, чем \nобъём определяемого понятия (в объём домашнего животного, кроме лошади, \nвходят ещё коровы, собаки и т. п.). Относительно такого определения можно \nтакже сказать, что в него не входит указание существенного признака данного \nпонятия. Если в определении опущены существенные признаки понятия, тогда \nоно окажется слишком широким, как в только что приведённом примере.Возьмём определение, которое погрешает в противоположном направлении. \nЕсли бы мы сказали, что «треугольник есть плоская прямолинейная фигура, \nимеющая три равные стороны», то это определение было бы слишком узким. \nВ нём объём определяющего понятия меньше объёма определяемого понятия. \nИменно: в объём определяющего понятия входят только равносторонние треу-\nгольники, а в объём определяемого понятия входят как равносторонние, так и \nнеравносторонние треугольники.\n"
        },
        {
            "termDef": "Правило 2 - Определение не должно делать круга. Это правило требует, чтобы определяе-\nмое понятие не определялось посредством понятия, которое само делается по-\nнятным только посредством определяемого. Возьмём, например, определение \n«вращение есть движение вокруг оси». Это определение понятия «вращение» \nпосредством понятия «ось» делает круг, ибо само понятие «ось» определяется \nтолько через понятие «вращение» (как известно, ось — это прямая, вокруг ко-\nторой происходит вращение). Таким образом, ясно, что в нашем определении \nполучается круг: понятие «вращение» определяется посредством понятия «ось», \nа понятие «ось» — посредством понятия «вращение».\n\tВ определении определяющее и определяемое должны быть двумя различны \nми и притом самостоятельными понятиями. Если это не соблюдается, то по-\nлучается ошибка, которая называется idem per idem, или тавтологией, именно: \nв определении получается только повторение того же слова, т.е. употребляются \nслова, имеющие то же самое значение. Например: «свет есть то, чему присущ \nсвет»; «величина есть то, что способно уменьшаться и увеличиваться». Послед-\nнее определение представляет собой тавтологию, потому что уменьшение есть \nубавление величины, увеличение же есть прибавление величины, а потому, если \nмы определяем величину посредством того, что способно увеличиваться или \nуменьшаться, то очевидно, что в определяющем понятии содержится опреде-\nляемое понятие.\n"
        },
        {
            "termDef": "Правило 3 - Определение не должно быть отрицательным, оно должно указывать признаки, \nприсущие данному понятию, а не чуждые ему, ибо эти последние для нас неваж-\nны и, кроме того, их можно указать очень много. Например, возьмём определе-\nние «театр есть здание, не служащее для жилья». Если A будет здание, служащее \nдля жилья, то не-A, или зданий, не служащих для жилья, будет бесчисленное \nмножество. Таким образом, это определение делается для нас непригодным. К \nчислу определений, которые вследствие своего отрицательного характера не-\nпригодны, нужно отнести следующие: «жидкость есть то, что не твёрдо и не га-\nзообразно», «точка есть то, что не имеет частей и не имеет никакой величины». \nОтрицательные определения не раскрывают содержания понятия, они оставля-\nют содержание понятия неопределённым. Поэтому отрицательные определения \nне отвечают главной цели определения — раскрыть содержание определяемого \nпонятия, сделать содержание понятия определённым.\nОтрицательные определения могут быть употребляемы только тогда, когда \nопределяемое понятие имеет отрицательный характер. Например, «чужестра-\nнец» — это человек, не принадлежащий к данной стране, и т. д.\n"
        },
        {
            "termDef": "Правило 4 - Определение должно быть ясным, т.е. в определении нельзя пользоваться вы-\nражениями двусмысленными, метафорическими и вообще мало понятными. \nНарушение этого правила приводит к попытке сделать понятным неизвестное \nчерез посредство ещё менее известного (ignotum per ignotius). Например, выра-\nжения «архитектура есть застывшая музыка» и «нужда есть мать изобретения» \n— это есть образные выражения, которые не объясняют значения термина. \nЕсли же сказать, что «эксцентричность есть своеобразная идиосинкразия», то \nмы непонятное пытаемся объяснить посредством непонятного же.\n"
        },
        {
            "termDef": "Еще кой чего - Есть случаи, когда нам приходится знакомиться с содержанием понятия не посред-\nством определения, а иными способами. Можно указать следующие способы, за-\nменяющие определение.\n1.\tУказание. Если, например, мы кого-нибудь желаем познакомить с тем, что такое \nтот или другой цвет, звук и т.п., то это мы будем в состоянии сделать только в \nтом случае, если приведём его в соприкосновение с данным цветом, звуком и \nт.п., т.е. вставим его воспринимать то, с чем мы желаем его ознакомить. Такой \nспособ ознакомления с известным понятием называется указанием. Указание \nупотребляется во всех случаях, когда нам приходится знакомить кого-нибудь с \nпредметами непосредственного восприятия:\n2.\tОписание  употребляется при ознакомлении с индивидуальными предметами \nили при ознакомлении со свойствами, принадлежащими какой-либо вещи. В \nтаком случае приводятся возможно точно и полно признаки этой вещи, напри-\nмер описание Днепра у Гоголя, Рейнского водопада у Карамзина и т.п. В бота-\nнике описывается строение того или иного цветка, процесс опыления и т.п., в \nхимии описывается та или иная реакция.\n3.\tХарактеристика  приводит выдающиеся признаки какого-либо предмета или яв-\nления. Если нам нужно познакомить кого-нибудь с тем, что такое «воображение \nпостроительное» и «воображение воспроизводящее», то мы вместо определе-\nния можем указать на какую-нибудь существенную черту, присущую тому или \nдругому виду воображения, например, говорим, что для построительного вооб-\nражения существенным является новизна сочетания, а для воспроизводящего \n— точность. Какое-нибудь свойство является характерным для того или дру-\nгого лица: для воина — мужество, для врача — гуманность и т.п. Характерной \nособенностью семейства крестоцветных растений являются цветы с четырьмя \nлисточками чашечки и четырьмя лепестками венчика, расположенными крест-\nнакрест, с двумя короткими и четырьмя длинными тычинками.4.\tСравнение  употребляется в том случае, когда мы знакомимся с тем или иным \nпонятием при помощи сравнения его с другими понятиями, похожими на него. \nМы можем дать понятие о теплопроводности какого-либо тела при помощи \nсравнения её со светопрозрачностью, например, если скажем, что теплопрово-\nдность по отношению к тепловым лучам есть то же самое, что прозрачность \nпо отношению к световым лучам. Сравнение употребляется главным образом \nтогда, когда одно понятие уясняется при помощи другого понятия, более яс-\nного, например, когда какое-либо абстрактное понятие уясняется при помощи \nкакого-либо конкретного. Например, «жизнь есть школа опыта», «право есть \nвоплощение, нравственной идеи», «совесть есть внутренний суд».\n5.\tРазличение  употребляется в том случае, когда мы знакомим кого-нибудь с со-\nдержанием какого-либо понятия, указывая на то различие, которое существует \nмежду данным понятием и другими, например, если мы говорим, что «энтузи-\nазм» отличается от «фанатизма» тем, что он вызывается чем-либо благородным \nи не переходит за пределы умеренности.\n"
        },
        {
            "termDef": "Задача деления - задача деления. От процесса определения отличается процесс деления (divisio). Различие между ними заключается в том, что {определение} раскрывадержание {понятия}, а деление раскрывает  {объём понятия}. Задача деления заключается в том, чтобы указать все виды, совокупность которых составляет {объём понятия}."
        },
        {
            "termDef": "Делимое понятие - {понятие}, подвергающееся {делению} по значению определенных {свойств}"
        },
        {
            "termDef": "Основание деления - {свойство} в {задаче деления}, по которому производят деление {рода} на {виды}, то мы обращаем внимание на те признаки, которыми обладают одни виды и не обладают другие. Тот признак, который даёт нам возможность разделить род на виды, называется основанием деления"
        },
        {
            "termDef": "Дихотомия - процесс в {задаче деления}, при котором {понятие} делится на {термин} А и его о {отрицательный термин}, не А"
        },
        {
            "termDef": "Члены деления должны разбивать объем родового понятия на части без остатка и взаимно непересекаться - "
        },
        {
            "termDef": "Деление должно иметь одно основание - "
        },
        {
            "termDef": "Определение - словесное описание {понятия}, включающее в себя присущие ему {свойства}"
        },
        {
            "termDef": "Простое суждение - {суждение} о принадлежности {свойства} какому либо {субъекту суждения}. Содержит {субъект суждения}, {предикат}, {отношение}, {квантор}"
        },
        {
            "termDef": "Субъект суждения -  основное {понятие} о котором говорится в {суждении}"
        },
        {
            "termDef": "Предикат - {свойство}, приписываемое {субъекту суждения}"
        },
        {
            "termDef": "Единичное суждение - {суждение} в котором {количество суждения} составляет 1. Относят к {общим суждениям}"
        },
        {
            "termDef": "Подлежащее - {субъект суждения}"
        },
        {
            "termDef": "Квантор - логическая операция, ограничивающая {объем понятия} {субъекта суждения}"
        },
        {
            "termDef": "Частное суждение - {суждение}, в котором {количество суждения} составляет часть {объема понятия}"
        },
        {
            "termDef": "Общее суждение - {суждение}, в котором {количество суждения} составляет полный {объем понятия}"
        },
        {
            "termDef": "Повествовательное суждение - {суждение}, содержащее в своем {предикате} высказывание о событии, состоянии, процессе"
        },
        {
            "termDef": "Описательное суждение - {суждение}, содержащее в своем {предикате} постоянные {свойства}. {Субъектом} обычно является конкретная вещь"
        },
        {
            "termDef": "Объяснительное суждение - {суждение}, относящее {субъект} {суждения} к какому либо {родовому понятию}"
        },
        {
            "termDef": "Акциденция - "
        },
        {
            "termDef": "Суждения тождества - "
        },
        {
            "termDef": "Суждения подчинения - "
        },
        {
            "termDef": "Суждения отношения пространства времени и причинности - "
        },
        {
            "termDef": "Суждение существования - "
        },
        {
            "termDef": "Количество суждения - {свойство} {суждения}, в котором указывается {объем понятия} {сущности} {суждения}"
        },
        {
            "termDef": "Качество суждения - {свойство} {суждения}, описывающее {суждение} как утверждающее некоторое положение вещей или отрицающее некоторое положение вещей"
        },
        {
            "termDef": "Отношение суждения - "
        },
        {
            "termDef": "Модальность суждения - характеристика {суждения}, описывающая строгость, тип {отношения} между {субъектом суждения} и {предикатом}"
        },
        {
            "termDef": "Утвердительное суждение - {суждение}, {качество суждения} которого что утверждает наличие, (принадлежность) {свойства} {субъекту суждения}"
        },
        {
            "termDef": "Отрицательное суждение - {суждение}, {качество суждения} которого утверждает отсутствие {предиката} у {субъекта суждения}"
        },
        {
            "termDef": "Общеутвердительное суждение - {суждение}, являющееся {общим сужением} и {утвердительным сужением}"
        },
        {
            "termDef": "Частноутвердительное суждение - {суждение}, являющееся {частным суждением} и {утвердительным суждением}"
        },
        {
            "termDef": "Общеотрицательное суждение - {суждение}, являющееся {общим суждением} и {отрицательным суждением}"
        },
        {
            "termDef": "Частноотрицательное суждение - {суждение}, являющееся {частным сужением}, и {отрицательным сужением}"
        },
        {
            "termDef": "A - {общеутвердительное суждение}"
        },
        {
            "termDef": "I - {частноутвердительное сужение}"
        },
        {
            "termDef": "E - {общеотрицательное суждение}"
        },
        {
            "termDef": "O - {частноотрицательное суждение}"
        },
        {
            "termDef": "Категорическое суждение - {суждение}, в котором {отношение} между {субъектом суждения} и {предикатом} утверждается или отрицается без какого-либо ограничения во времени, в пространстве или вообще в \nкаких-либо обстоятельствах"
        },
        {
            "termDef": "Условное суждение - {суждение}, в котором высказываемое {отношение} ограничено определенным условием"
        },
        {
            "termDef": "Разделительное суждение - {суждение}, содержащее в себе несколько {простых суждений}, связанных {логической связью} истинно из которых только одно. {Деление} должно быть полным"
        },
        {
            "termDef": "Проблематическое суждение - {суждение}, {модальность суждения} которого указывает на вероятностный характер {отношения} между {субъектом суждения} и {предикатом}"
        },
        {
            "termDef": "Асерторическое суждение - {суждение}, для которого {модальность суждения} такая, что для неё представима инверсия {отношения}"
        },
        {
            "termDef": "Аподиктическое суждение - {суждение}, для которого {модальность суждения} такая, что для неё не представима инверсия {отношения}"
        },
        {
            "termDef": "Закон мышления - "
        },
        {
            "termDef": "Закон тождества - {Закон мышления}"
        },
        {
            "termDef": "Закон противоречия - {Закон мышления}"
        },
        {
            "termDef": "Закон исключенного третьего - {Закон мышления}"
        },
        {
            "termDef": "Закон достаточного основания - {Закон мышления}"
        },
        {
            "termDef": "Непосредственное умозаключение - {умозаключение}"
        },
        {
            "termDef": "Умозаключение в собственном смысле - {умозаключения}"
        },
        {
            "termDef": "Индукция - {умозаключения в собственном смысле} процесс мышления, посредством которого мы выводим, что истинное в каком-либо частном случае или частных случаях будет истинным и во всех случаях, сходных с предыдущими"
        },
        {
            "termDef": "Дедукция - {умозаключения в собственном смысле}"
        },
        {
            "termDef": "Аналогия - {умозаключения в собственном смысле}"
        },
        {
            "termDef": "Умозаключение о противоположности - {Непосредственное умозаключение}"
        },
        {
            "termDef": "Умозаключение от подчиняющего к подчинённому - {умозаключение о противоположности}. От {A} к {I} или от {E} к {O}"
        },
        {
            "termDef": "Умозаключение от подчинённого к подчиняющему - {умозаключение о противоположности}"
        },
        {
            "termDef": "Adcontradictoriam - {умозаключение о противоположности}"
        },
        {
            "termDef": "Adcontrariam - {умозаключение о противоположности}"
        },
        {
            "termDef": "Ad subcontrariam - {умозаключение о противоположности}"
        },
        {
            "termDef": "Превращение - {непосредственное умозаключение}"
        },
        {
            "termDef": "Обращение - {непосредственное умозаключение}"
        },
        {
            "termDef": "Противопоставление - {непосредственное умозаключение}"
        },
        {
            "termDef": "Силлогизм - такая форма {умозаключения}, в \nкоторой из двух {суждений} необходимо вытекает третье, причём одно из двух данных {суждений} является {общеутвердительное суждение} или {общеотрицательное суждение}"
        },
        {
            "termDef": "Во всяком силлогизме должно ровно 3 понятия - {понятие}, {силлогизм}"
        },
        {
            "termDef": "Во всяком силлогизме должно быть ровно 3 суждения - {силлогизм} {суждение}"
        },
        {
            "termDef": "Среднее понятие должно быть взято по крайней мере в одной из посылок во всём объёме понятия - {силлогизм} {понятие} {объем понятия}"
        },
        {
            "termDef": "Из двух отрицательных суждений нельзя вывести никакого заключения - {суждение} {заключение} {силлогизм}"
        },
        {
            "termDef": "Если одна из посылок есть суждение частное, то и заключение также должно \rбыть частным. - {силлогизм}"
        },
        {
            "termDef": "Метод индуктивного определения причинности - метод позволяющий установить причинно-следственную связь, через {индукцию}"
        },
        {
            "termDef": "Метод согласия - это {метод индуктивного определения причинности} если двум или большему числу случаев исследуемого явления природы обще лишь одно обстоятельство, то именно то обстоятельство, в котором все случаи согласуются, есть причина данного явления"
        },
        {
            "termDef": "Метод разницы - {метод индуктивного определения причинности} Если случай, в котором известное явление природы наступает, и случай, в котором оно не наступает, имеют общими все обстоятельства, за исключением одного, и это одно обстоятельство встречается только в первом случае, то обстоятельство, в котором оба случая разнятся между собой, и есть причина либо необходимая часть причины изучаемого явления природы"
        },
        {
            "termDef": "Метод остатков - {метод индуктивного определения причинности} Вычти из данного явления природы ту часть его, которая, благодаря прежним индукциям, известна как действие определённых предшествующих, и остающаяся часть (остаток) явления природы будет действием остальных предшествующих"
        },
        {
            "termDef": "Метод сопутствующих изменений -  {метод индуктивного определения причинности} Если некоторое изменение предшествующего A всегда сопровождается пере-меною в последующем a, а другие последующие b  и c  остаются теми же, или, наобо-рот, если каждой перемене a  предшествовало видоизменение в A, которое не было замечаемо в других предшествующих, то мы можем заключать, что a  вполне или от-части есть действие A или же, по крайней мере, соединено с ним некоторой связью причины с действием"
        },
        {
            "termDef": "Дедуктивное объяснение закона - {дедукция}"
        },
        {
            "termDef": "Эмпирический закон - закон, найденный {индуктивно}"
        },
        {
            "termDef": "Производный закон - {Эмпирический закон}, объясненный {дедуктивным} методом"
        },
        {
            "termDef": "Рациональность - способность {достигать цель} наиболее эффективным способом"
        },
        {
            "termDef": "Рациональность это способность достигать поставленную цель наиболее эффективным способом - "
        },
        {
            "termDef": "Эпистемическая рациональность - "
        },
        {
            "termDef": "Прикладная рациональность - "
        },
        {
            "termDef": "Цель - {образ} желательного результата"
        },
        {
            "termDef": "Абсолютно дизюнктивное мышление - "
        },
        {
            "termDef": "Нарушение доминантных отношений - "
        },
        {
            "termDef": "Эффект флинна - "
        },
        {
            "termDef": "Эвристика по умолчанию - "
        },
        {
            "termDef": "Теория принятия решений - "
        },
        {
            "termDef": "Дескриптивная инвариантность - "
        },
        {
            "termDef": "Упражнение на избавление от эффекта фрейминга - "
        },
        {
            "termDef": "Эгоцентрической предубеждение - "
        },
        {
            "termDef": "Иллюзия контроля - "
        },
        {
            "termDef": "Интертемпоральное обращение предпочтений - "
        },
        {
            "termDef": "Количество когнитивных искажений возможно совпадает с количеством конкурирующих связей между зонами мозга - "
        },
        {
            "termDef": "Гипорболтческая кривая обесценивания - "
        },
        {
            "termDef": "Идея о том, что мемы распространяются независимо от полезности - "
        },
        {
            "termDef": "Сущность - вещь, о которой мы {мыслим}, как об отдельной от любых других вещей"
        },
        {
            "termDef": "Свойство - обобщенная характеристика, не существующая сама по себе, но обладание которой можно приписать многим разным {сущностям}"
        },
        {
            "termDef": "Операция - процесс, в результате которого {сущность} получает, изменяет или теряет некоторые  {свойства}"
        },
        {
            "termDef": "Мыслительная операция - "
        },
        {
            "termDef": "Мысль - собирательный термин для множества {психических процессов}, происходящих в {мозге}"
        },
        {
            "termDef": "Модель - упрощённое представление о {реальности}"
        },
        {
            "termDef": "Реальность - окружающий мир в самом широком смысле"
        },
        {
            "termDef": "Образ - {модель} сформированная в {мозге}"
        },
        {
            "termDef": "Мозг - "
        },
        {
            "termDef": "Отношение - некоторая, поддающаяся оценке, связь между {сущностями} и {свойствами}"
        },
        {
            "termDef": "Серийное ассоциативное когнитивное мышление с основным предубеждением - "
        },
        {
            "termDef": "Первое правило когнитивного скряги - по-умолчанию используй {мышление первого типа}"
        },
        {
            "termDef": "Второе правило когнитивного скряги - если нужно использовать {мышление второго типа}, по умолчанию используй {серийное ассоциативное когнитивное мышление с основным предубеждением}"
        },
        {
            "termDef": "Дефицит программ - "
        },
        {
            "termDef": "Ошибка подавления - "
        },
        {
            "termDef": "Когнитивный скряга - "
        },
        {
            "termDef": "Мышление первого типа - "
        },
        {
            "termDef": "Мышление второго типа - "
        },
        {
            "termDef": "Заражённые программы - "
        },
        {
            "termDef": "Проблемы умственных программ - "
        },
        {
            "termDef": "Инструментальная рациональность - "
        },
        {
            "termDef": "Достижение цели - процесс приведения {реальности} в соответствие с {целью}"
        },
        {
            "termDef": "Знание вероятностей - "
        },
        {
            "termDef": "Важность альтернативных гипотез - "
        },
        {
            "termDef": "Структуры знаний в конкретных областях - "
        },
        {
            "termDef": "Бытовая психологическая теория - "
        },
        {
            "termDef": "Стратегия избегания оценки - "
        },
        {
            "termDef": "Самоинициирующееся эгоцентрической мышление - "
        },
        {
            "termDef": "Эгоцентризм модели мира - "
        },
        {
            "termDef": "Аффективная подмена - "
        },
        {
            "termDef": "Аффективное прогнозирование - способность предсказать, что сделает человека счастливым в будущем"
        },
        {
            "termDef": "Паразитическая стратегия - "
        },
        {
            "termDef": "Основания для заразности идей - "
        },
        {
            "termDef": "Объяснение через миметику - "
        },
        {
            "termDef": "Стратегии вирулентности мемов - "
        },
        {
            "termDef": "Должен - "
        },
        {
            "termDef": "Бритва Оккама - {бритва}, утверждающая что более простые объяснения с большей вероятностью {истинны}, и следует избегать излишних или невероятных предположений."
        },
        {
            "termDef": "Аксиома - {суждение} принимаемое в рамках данной теории {истинным} без требования {доказательств}"
        },
        {
            "termDef": "Истина - {суждение}, соответствующее {реальности}"
        },
        {
            "termDef": "Гипотеза - {суждение}, об {истинности} которого ничего не известно"
        },
        {
            "termDef": "Фальсифицируемость - {свойство} {гипотезы} быть в принципе опровержимой. Важный критерий научности гипотезы."
        },
        {
            "termDef": "Эксперимент - процедура, выполняемая для  опровержения или подтверждения {гипотезы}"
        },
        {
            "termDef": "Доказательство - одно или несколько связанных {верных умозаключений}, подтверждающих {истинность} {вывода} из {предпосылок}"
        },
        {
            "termDef": "Теория - {гипотеза}, подтвержденная {доказательством}"
        },
        {
            "termDef": "Наука - группа {аксиом}, {экспериментов}, взаимосвязанных {теорий} их объясняющих и способов проверки {истинности} {гипотез}"
        },
        {
            "termDef": "Вывод - {суждение}, полученное в результате {умозаключения}"
        },
        {
            "termDef": "Умозаключение - вид {мышления}, при котором из одного или нескольких {суждений} и применения некоторых правил формулируется новое {суждение}"
        },
        {
            "termDef": "Верное умозаключение - вид {умозаключения}, благодаря которому из одного или нескольких {истинных} {предпосылок} можно получить  {вывод} соответствующий {истине}."
        },
        {
            "termDef": "Логика - {наука}, изучающая способы получения {верных умозаключений}"
        },
        {
            "termDef": "Контрфактуальное мышление - "
        },
        {
            "termDef": "Апофения - "
        },
        {
            "termDef": "Парейдолия - "
        },
        {
            "termDef": "Бритва - {презумпция}, которая позволяет отбросить маловероятные объяснения какого-либо феномена, или избежать необязательных действий."
        },
        {
            "termDef": "Презумпция - {суждение} многократно подтвержденное практикой и использующееся как отправная точка для дальнейших {умозаключений}"
        },
        {
            "termDef": "Индуктивное умозаключение - "
        },
        {
            "termDef": "Дедуктивное умозаключение - "
        },
        {
            "termDef": "Предпосылка - {суждение}, известное до {умозаключения}"
        },
        {
            "termDef": "Мышление - процесс формирования {мыслей} {мозгом}"
        },
        {
            "termDef": "Инструмент проверки истинности - "
        },
        {
            "termDef": "Бритва Хитченса - {бритва} утверждающая что {суждение} высказанное без {доказательств}, может быть также отвергнуто без {доказательств}."
        },
        {
            "termDef": "Бритва Алдера - {бритва}, утверждающая что то, что нельзя подтвердить {экспериментом}, не стоит обсуждать"
        },
        {
            "termDef": "Пылающий лазерный меч Ньютона - {бритва Алдера}"
        },
        {
            "termDef": "Эталон Сагана - {бритва}, утверждающая что экстраординарные утверждения требуют экстраординарных {доказательств}"
        },
        {
            "termDef": "Критерий Поппера - {бритва}, утверждающая что для того чтобы {гипотеза} считалась научной, она должна быть {фальсифицируемой}."
        },
        {
            "termDef": "Бремя доказательства - "
        },
        {
            "termDef": "Объяснительная сила теории - "
        },
        {
            "termDef": "Деление - "
        },
        {
            "termDef": "Квантор всеобщности - {квантор}"
        },
        {
            "termDef": "Квантор существования - {квантор}"
        },
        {
            "termDef": "Отрицание - {логическая операция} отрицания \"не\""
        },
        {
            "termDef": "Логическая операция - "
        },
        {
            "termDef": "Коньюнкция - {логическая операция} умножения \"и\""
        },
        {
            "termDef": "Дизъюнкция - {логическая операция} сложения \"или\""
        },
        {
            "termDef": "Импликация - {логическая операция} следования \"если, то...\""
        }
    ]
}
